module Handlers
  class Sauces < Base
    WORDINGS = [
      '那要先將蘋果，洋蔥等切成末之後，跟各種調味料以絕妙的比例互相調合。',
      '再給我一分鐘我一定能完成的。',
      '你從什麼時候開始產生了我有%s的錯覺？',
      '%s?%s你老木!你有%s嗎?',
      '%s正在你後面他非常火',
      '一切都是%s的錯',
      "我本來不想有%s的，直到#{['他','我','你', '李嚴'].sample}的膝蓋中了一箭",
      '不好的是%s，李嚴本身並沒有錯',
      '%s多了不起啊?',
      '%s是絕對不會放過你的',
      '快道歉，快出來跟%s道歉，%s人很好的一定會原諒你，快道歉!',
      '%s是不好的',
      '不好了!!%s它...它...',
      '%s再戰十年',
      '先生也懂%s?',
      '%s，不要白目!'
    ].freeze

    def pattern
      /所以我說那個(.+)[呢|勒]/i
    end

    def outcome
      word = key_words[0] || '醬汁'
      WORDINGS.sample % %W(#{word} #{word} #{word})
    end
  end
end